Repository: allymf/GenerativeMagicTCC
Catalog: GenerativeMagicTCC/Template/PlaygroundBook/PrivateResources/*.lproj/Localizable.strings
Languages: pt_br

source: Select an image
pt_br: Selecione uma imagem

source: Now Run Your Code
pt_br: Agora Execute Seu Código

source: Pick an image
pt_br: Escolha uma imagem

source: Select the source of the photo
pt_br: Selecione a origem da foto

source: Camera
pt_br: Câmera

source: Library
pt_br: Biblioteca

source: Saved Photos
pt_br: Fotos Salvas

# btPlay
source: Play
pt_br: Tocar

# btPause
source: Pause
pt_br: Pausar

# btUndo
source: Undo
pt_br: Desfazer

# btClear
source: Clear
pt_br: Limpar

# PassI1
source: Great job! You typed the appropriate code to create the piece. If the piece didn’t appear, try selecting an image. We’re going to expand on this concepts on the [next page](@next).
pt_br: Bom trabalho! Você digitou o código apropriado para criar a peça. Se a peça não apareceu, tente selecionar uma imagem. Nós vamos expandir nesses conceitos na [próxima página](@next).

# Hint1I1
source: Remember to call either `drawCircleWith` or `drawSquareWith`, and also pass it the pixel’s *color* and *position*
pt_br: Lembre de chamar a função `drawCircleWith` ou `drawSquareWith`, e também de passar a variável **color** e **position** extraídas do pixel atual.

# Hint2I1
source: Also mind the size value passed to the function.
pt_br: Se preocupe também do valor passado no parâmetro **size** da function.

# HintGI1
source: Use one of the previously said shape functions and pass it the two variable inside the for in loop. Don't forget to pick an image
pt_br: Use uma das funções de formas previamente citadas e passe as duas variáveis no laço de repetição for in. Não se esqueça de escolher uma imagem.

# PassI2
source: Way to go! You can play around with the font type, font size and also the text to get different results. If the piece didn't appear, try selecting an image.
pt_br: Muito bem! Você pode brincar um pouco com o tipo da fonte, seu tamanho e também o texto para conseguir resultados diferentes. Se a peça não apareceu, tente selecionar uma imagem.

# Hint1I2
source: Remember to use a non empty text value.
pt_br: Lembre-se de colocar um texto que não esteja vazio.

# Hint2I2
source: Also remember to pass on the pixel’s **color** and **position**.
pt_br: Lembre também de passar as variáveis **color** e **position** do pixel atual.

# Hint3I2
source: Do mind the the value given to the **fontSize** parameter.
pt_br: Atente para o valor passado no campo **fontSize**.

# Hint4I2
source: It’s also important that the variable **fontType** has a valid value (chalk, futura or noteworthy)
pt_br: Também é importante que a variável **fontType** tenha um valor válido (chalk, futura ou noteworthy).

# HintGI2
source: Remember to use the `displayNextCharacterIn` function
pt_br: Lembre de usar a função `displayNextCharacterIn`
